//TRUTTMAP JOB 'COMPMAPA',CLASS=C,MSGCLASS=X,NOTIFY=&SYSUID             00010000
//*                                                                     00010100
//PROCLIB JCLLIB ORDER=TRAIN.PROCLIB                                    00010200
//*                                                                     00010300
//      EXEC TRCICMAP,MAPNAME=TR00MTT                                   00010400
