//TRUTTXXX JOB 'SORT JOIN',CLASS=C,NOTIFY=&SYSUID,TIME=(0,30)
//PROCLIB JCLLIB ORDER=TRAIN.PROCLIB                         
//STEP99  EXEC TRCOBCL,P=COB013  ,PARMC=TEST