//TRUTTCIC JOB 'COMP CICS',CLASS=C,MSGCLASS=X,NOTIFY=&SYSUID            00010000
//*                                                                     00010100
//PROCLIB JCLLIB ORDER=TRAIN.PROCLIB                                    00010200
//*                                                                     00010300
//  EXEC TRCICCOB,P=TR00PTT2                                            00010400
