//TRUTTXXX  JOB 'EXEC014',CLASS=A,NOTIFY=&SYSUID,TIME=(0,10)
//STEP01    EXEC PGM=COB014
//STEPLIB   DD   DSN=TRUTT.TRAING00.LINKLIB,DISP=SHR
//SYSIN     DD   *
25
25
