//TRUTTXXX  JOB 'EXECVS03',CLASS=A,NOTIFY=&SYSUID,TIME=(0,10)
//STEP01    EXEC PGM=COBVSA03
//STEPLIB   DD   DSN=TRUTT.TRAING00.LINKLIB,DISP=SHR
//ARQCLI    DD   DSN=TRUTT.TRAING00.ARQCLI.KSDS,DISP=SHR
//SYSIN     DD   *
000000002ALEXANDRE ALMEIDA O  SEGUNDO  00001535
