//TRUTTXXX  JOB 'EXEC016',CLASS=A,NOTIFY=&SYSUID,TIME=(0,01)
//STEP01    EXEC PGM=COB016
//STEPLIB   DD   DSN=TRUTT.TRAING00.LINKLIB,DISP=SHR
//SYSIN     DD   *
00100000
0010
