//TRUTTXXX  JOB 'EXEC014A',CLASS=A,NOTIFY=&SYSUID,TIME=(0,10)
//STEP01    EXEC PGM=COB014A
//STEPLIB   DD   DSN=TRUTT.TRAING00.LINKLIB,DISP=SHR
//SYSIN     DD   *
15
05
25
