//TRUTTXXX  JOB 'EXECAR01',CLASS=A,NOTIFY=&SYSUID,TIME=(0,10)
//STEP01    EXEC PGM=COBARQ05
//STEPLIB   DD   DSN=TRUTT.TRAING00.LINKLIB,DISP=SHR
//EARQ0811  DD   DSN=TRUIP.TRAING00.EARQ0811,DISP=SHR
