//TRUTTXXX  JOB 'EXEC012',CLASS=A,NOTIFY=&SYSUID,TIME=(0,10) 
//STEP01    EXEC PGM=COB012                                  
//STEPLIB   DD   DSN=TRUTT.TRAING00.LINKLIB,DISP=SHR         
//SYSIN     DD   *                                           
TIAGO MOUTINHO RUA DO PORTO   1546PORTO          THIS IS FIL 