//TRUTTXXX  JOB 'EXECAR01',CLASS=A,NOTIFY=&SYSUID,TIME=(0,10)
//STEP01    EXEC PGM=COBREL
//STEPLIB   DD   DSN=TRUTT.TRAING00.LINKLIB,DISP=SHR
//CLIENTES  DD   DSN=TRUIP.TRAING00.CLIENTEN,DISP=SHR
