//TRUTTXXX  JOB 'EXEC008',CLASS=A,NOTIFY=&SYSUID,TIME=(0,10)
//STEP01    EXEC PGM=COB008                                 
//STEPLIB   DD   DSN=TRUTT.TRAING00.LINKLIB,DISP=SHR        
//SYSIN     DD   *                                          
8015JOAO CARLOS OLIVEIRA          BR0000150000              