//TRUTTXXX  JOB 'EXEC013',CLASS=A,NOTIFY=&SYSUID,TIME=(0,10)
//STEP01    EXEC PGM=COB013
//STEPLIB   DD   DSN=TRUTT.TRAING00.LINKLIB,DISP=SHR
//SYSIN     DD   *
2500
0200
