//TRUTTXXX  JOB 'EXEC015',CLASS=A,NOTIFY=&SYSUID,TIME=(0,10)
//STEP01    EXEC PGM=COB015
//STEPLIB   DD   DSN=TRUTT.TRAING00.LINKLIB,DISP=SHR
//SYSIN     DD   *
TELEVISAO                     0000100099PORTO
