//TRUTTXXX  JOB 'EXEC007',CLASS=A,NOTIFY=&SYSUID,TIME=(0,10)
//STEP01    EXEC PGM=COB007                                 
//STEPLIB   DD   DSN=TRUTT.TRAING00.LINKLIB,DISP=SHR        
//SYSIN     DD   *                                          
005300                                                      
0000000630                                                  