//TRUTTXXX  JOB 'EXECVS01',CLASS=A,NOTIFY=&SYSUID,TIME=(0,10)
//STEP01    EXEC PGM=COBVSA01
//STEPLIB   DD   DSN=TRUTT.TRAING00.LINKLIB,DISP=SHR
//ARQCLI    DD   DSN=TRUTT.TRAING00.ARQCLI.KSDS,DISP=SHR
//SYSIN     DD   *
000213456
//*000213456
