//TRUTTXXX  JOB 'EXEC009',CLASS=A,NOTIFY=&SYSUID,TIME=(0,10)
//STEP01    EXEC PGM=COB009                                 
//STEPLIB   DD   DSN=TRUTT.TRAING00.LINKLIB,DISP=SHR        
//SYSIN     DD   *                                          
00007515                                                    
00005025                                                    