//TRUTTXXX  JOB 'EXEC002',CLASS=A,NOTIFY=&SYSUID,TIME=(0,10)
//STEP01    EXEC PGM=COB003                                 
//STEPLIB   DD   DSN=TRUTT.TRAING00.LINKLIB,DISP=SHR        
//SYSIN     DD   *                                          
0001                                                        
CURSO DE MAINFRAME - COBOL                                  