//TRUTTXXX  JOB 'EXECVS99',CLASS=A,NOTIFY=&SYSUID,TIME=(0,10)
//STEP01    EXEC PGM=COBVSA99
//STEPLIB   DD   DSN=TRUTT.TRAING00.LINKLIB,DISP=SHR
//ARQCLI    DD   DSN=TRUTT.TRAING00.ARQCLI.KSDS,DISP=SHR
//SYSIN     DD   *
E
000000000ALBERTO CAEIRO                00051200
