//TRUTTXXX  JOB 'EXECVS04',CLASS=A,NOTIFY=&SYSUID,TIME=(0,10)
//STEP01    EXEC PGM=COBVSA05
//STEPLIB   DD   DSN=TRUTT.TRAING00.LINKLIB,DISP=SHR
//ARQCLI    DD   DSN=TRUTT.TRAING00.ARQCLI.KSDS,DISP=SHR
//SYSIN     DD   *
000000002ALBERTO CAEIRO                00051200
