//TRUTTXXX  JOB 'EXEC001',CLASS=A,NOTIFY=&SYSUID,TIME=(0,10)
//STEP01    EXEC PGM=COB001                                 
//STEPLIB   DD   DSN=TRUTT.TRAING00.LINKLIB,DISP=SHR