//TRUTTXXX JOB 'APPROCCRE',CLASS=A,NOTIFY=&SYSUID,TIME=(0,05) 
//PROCLIB JCLLIB ORDER=TRUTT.TRAING00.PROCLIB                 
//STEP01 EXEC PROCREAT,NAME=TEST,SIZE=80,BLOC=27920           