//TRUTTXXX JOB 'EXER04,EXER02',CLASS=A,NOTIFY=&SYSUID,TIME=(0,05) 
//*--------------------------------------                         
//STEP01   EXEC PGM=EXER02                                        
//STEPLIB  DD DSN=TRUIP.TRAING00.LINKLIB,DISP=SHR                 
//SYSIN    DD *                                                   
TIAGO TEIXEIRA                                                    
/*                                                                