//TRUTTXXX JOB 'EXER02,IEFBR14',CLASS=A,NOTIFY=&SYSUID,TIME=(0,05) 
//*--------------------------------------------                    
//STEP01   EXEC PGM=IEFBR14                                        
//*--------------------------------------------                    
//STEP02   EXEC PGM=IEFBR14                                        