//TRUTTXX1 JOB 'EXER 1',CLASS=A,NOTIFY=TRUTT  
//*---------------                            
//PROCLIB  JCLLIB ORDER=TRUIP.TRAING00.JCLLIB 
//STEP1    EXEC PROCBAS2,ARQUIVO='MOV1023'    