//TRUTTXXX JOB 'EXER05A,EXER1&EXER02',CLASS=A,NOTIFY=&SYSUID,
//            TIME=(0,05)                                    
//JOBLIB   DD DSN=TRUIP.TRAING00.LINKLIB,DISP=SHR            
//*--------------------------------------                    
//STEP01   EXEC PGM=EXER1                                    
//*--------------------------------------                    
//STEP02   EXEC PGM=EXER02                                   
//SYSIN    DD *                                              
TIAGO TEIXEIRA                                               
/*                                                           