//TRUTTXXX JOB 'EXER04,EXER1',CLASS=A,NOTIFY=&SYSUID,TIME=(0,05)
//*--------------------------------------                       
//STEP01   EXEC PGM=EXER1                                       
//STEPLIB  DD DSN=TRUIP.TRAING00.LINKLIB,DISP=SHR               