//TRUTTXXX JOB 'SORT03',CLASS=A,NOTIFY=&SYSUID,TIME=(0,02)
//********** EXERCICIO DE ORGANIZACAO DE FILE
//STEP01   EXEC PGM=SORT
//SORTIN   DD   DSN=TRUIP.TRAING00.EARQBASE,DISP=SHR
//SORTOUT  DD   SYSOUT=*
//SYSOUT   DD   SYSOUT=*
//SYSIN    DD   *
 SORT FIELDS=(48,01,CH,A,10,30,CH,A)
