//TRUTTXXX JOB 'SORT06',CLASS=A,NOTIFY=&SYSUID,TIME=(0,02)
//********** CLASSIFICA POR 1 CHAVE AGENCIA - CONTA 01 - 10
//STEP01   EXEC PGM=SORT
//SORTIN   DD   DSN=TRUTT.TRAING00.SORTLANC,DISP=SHR
//SORTOUT  DD   SYSOUT=*
//SYSOUT   DD   SYSOUT=*
//SYSIN    DD   *
 SORT FIELDS=(01,10,CH,A)
