//TRUTTXXX JOB 'SORT02',CLASS=A,NOTIFY=&SYSUID,TIME=(0,02)
//********** CLASSIFICA POR 1 CHAVE - CIDADE 01 - 09
//STEP01   EXEC PGM=SORT
//SORTIN   DD   DSN=TRUTT.TRAING00.ARQBASE,DISP=SHR
//SORTOUT  DD   SYSOUT=*
//SYSOUT   DD   SYSOUT=*
//SYSIN    DD   *
 SORT FIELDS=(01,09,CH,A)
