//TRUTTXXX JOB 'SORT01A',CLASS=A,NOTIFY=&SYSUID,TIME=(0,02)
//STEP01   EXEC PGM=ICEGENER
//SYSPRINT DD   SYSOUT=*
//SYSUT1   DD   DSN=TRUIP.TRAING00.ARQBASE,DISP=SHR
//SYSUT2   DD   DSN=TRUTT.TRAING00.ARQBASE,DISP=SHR
