//TRUTTXXX JOB 'SORT03',CLASS=A,NOTIFY=&SYSUID,TIME=(0,02)
//********** CLASSIFICA POR 2 CHAVE - CIDADE 01 - 09, REGIAO 10 - 09
//STEP01   EXEC PGM=SORT
//SORTIN   DD   DSN=TRUTT.TRAING00.ARQBASE,DISP=SHR
//SORTOUT  DD   SYSOUT=*
//SYSOUT   DD   SYSOUT=*
//SYSIN    DD   *
 SORT FIELDS=(10,09,CH,A,01,09,CH,A)
