//TRUTTXXX JOB 'SORT09',CLASS=A,NOTIFY=&SYSUID,TIME=(0,02)
//********** CLASSIFICA E APLICA STOPAFT E SKIPREC
//STEP01   EXEC PGM=SORT
//SORTIN   DD   *
0001 A
0002 B
0003 C
0003 D
0004 E
0005 F
0006 G
0007 H
0008 I
//SORTOUT  DD   SYSOUT=*
//SYSOUT   DD   SYSOUT=*
//SYSIN    DD   *
 SORT FIELDS=(01,04,CH,A),STOPAFT=05,SKIPREC=02
 SUM FIELDS=NONE
