//TRUTTXXX JOB 'SORT03',CLASS=A,NOTIFY=&SYSUID,TIME=(0,02)
//********** CLASSIFICA POR 1 CHAVE - CIDADE 01 - 09
//*          E GUARDA EM NOVO ARQUIVO
//STEP01   EXEC PGM=SORT
//SORTIN   DD   DSN=TRUTT.TRAING00.ARQBASE,DISP=SHR
//SORTOUT  DD   DSN=TRUTT.TRAING00.ARQBASEX,
//         DISP=(NEW,CATLG,DELETE),
//         LIKE=TRUTT.TRAING00.ARQBASE
//SYSOUT   DD   SYSOUT=*
//SYSIN    DD   *
 SORT FIELDS=(01,09,CH,A)
